'use strict'

//tmp stub
module.exports = function Quests() {
    return {
        "hello": {
            name: {
                "en": "",
                "ru": "Тёплый приём"
            },
            desc: {
                "en": "",
                "ru": "Ты решил у нас задержаться? Хорошо, но тебе придется построить себе дом, как минимум. Для этого тебе понадобится инструмент. В этом деле тебе поможет местный шахтер, Ахпер, беги к нему. ",
            },
            final: {
                "en": "",
                "ru": "Здарова, коль не шутишь. Тебя Чарльз прислал, или ты просто, мимо проходил, да решил заглянуть? В любом случае, добро пожаловать в мою камнеломню.",
            },
        },
        "tour-1": {
            name: {
                "en": "",
                "ru": "Создаем кирку",
            },
            desc: {
                "en": "",
                "ru": "Итак, давай сразу к делу, ибо времени у меня мало. В первую очередь, чтобы начать что-то делать, тебе понадобится кирка - с нее и начнем. Беги в лес, сорви пару суков с деревьев, пару веток и сделай себе кирку. Камней можешь у меня купить или под ногами насобирать.",
            },
            tip: {
                "en": "",
                "ru": "ПКМ по деревьям даст возможность сорвать сук и ветку. Полученные сук и ветку надо обломать через пкм в инвентаре. Клик по молоту справа вызовет окно крафта, вводим в поиск \"острый камень\" или находим его в \"обработка камня\". Компоненты для него покупаем или находим в природе. Получив острый камень делаем Каменную Кирку.",
            },
            final: {
                "en": "",
                "ru": "Хорошая работа, старина. С помощью этого инструмента ты сможешь откалывать камни от булыжников и валунов.",
            },
        },
        "tour-2": {
            name: {
                "en": "",
                "ru": "Создаем нож",
            },
            desc: {
                "en": "",
                "ru": "Кирка - это здорово. Но все знают, что без хорошего ножа в наше время не обойтись. Тебе нужен нож, сделай его! ",
            },
            tip: {
                "en": "",
                "ru": "Нож и Кирка должны находиться в руках, для возможности взаимодействия с камнями и тушками животных.",
            },
            final: {
                "en": "",
                "ru": "Отлично! Теперь ты можешь разделывать туши животных и еще много полезного.",
            },
        },
        "tour-3": {
            name: {
                "en": "",
                "ru": "Создаем оружие",
            },
            desc: {
                "en": "",
                "ru": "Ты уже не мало побегал по местным лесам, много животных видел, наверное. Некоторые из них довольно агрессивные. Чтобы постоять за себя тебе понадобиться оружие. В самом начале, лучшим вариантом будет заточить хороший крепкий сук, сорванный с какого-нибудь дерева. Тут тебе и пригодится нож.",
            },
            final: {
                "en": "",
                "ru": "Этим будет значительно легче поймать себе обед.",
            },
        },
        "hunger-1": {
            name: {
                "en": "",
                "ru": "В Таверну, к Шот",
            },
            desc: {
                "en": "",
                "ru": "Собственно, это все, что тебе нужно сейчас знать о создании вещей, дальше сам разберешься. Ты кстати, проголадался наверное, пока бегал? Иди в таверну к Шот, она тебя покормит, может еще узнешь что интересное. ",
            },
            tip: {
                "en": "",
                "ru": "Таверна это большое заведение напротив Чарльза",
            },
            final: {
                "en": "",
                "ru": "Я всегда рада новым людям в нашем трактире, присаживайся, поговорим с тобой. ",
            },
        },
        "hunger-2": {
            name: {
                "en": "",
                "ru": "Голод, жажда",
            },
            desc: {
                "en": "",
                "ru": "Может перекусишь чего? Если долго ходить голодным, то силы твои будут исчезать, а потом и вовсе, кирдык... Лапы к верху... Брррр, ужас. А если добротно поесть, то силы будут сами к тебе потихоньку приходить. Только смотри не переусердствуй, а то знаешь как бывает: с полным животом от волка не убежишь! Так что вот, держи меню, можешь что-нибудь выбрать.",
            },
            tip: {
                "en": "",
                "ru": " Купите у Шот суп, съешьте. Если переедание - туалет неподалеку. Заодно научитесь справлять нужду, немаловажный навык выживания.",
            },
            final: {
                "en": "",
                "ru": "Ну что, наелся? То-то же, у нас тут все свежее, вкусное.",
            },
        },
        "hunger-3": {
            name: {
                "en": "",
                "ru": "Витамины",
            },
            desc: {
                "en": "",
                "ru": "Еда у нас в трактире вкусная, но не дает витаминов, а лишь энергию. А чтобы развивать в себе атрибуты, тебе необходимы витамины. А от атрибутов напрямую зависят твои навыки.",
            },
            "wiki": {
                "ru": ["Атрибут", "Пища"]
            },
            final: {
                "en": "",
                "ru": "Ах да, забыла сказать, что немалое количество витаминов находится в выпечке всякой и мясе, если его грамотно приготовить.",
            },
        },
        "tour-4": {
            name: {
                "en": "",
                "ru": "К Чарльзу",
            },
            desc: {
                "en": "",
                "ru": "Теперь ты накормлен, напоен, пора и честь знать! Кстати, мне передал Чарльз, что он хочет тебя видеть. Так что иди к нему сейчас, но не забывай заглядывать к нам, буду рада видеть.",
            },
            tip: {
                "en": "",
                "ru": "",
            },
            final: {
                "en": "",
                "ru": "Рад снова видеть тебя! Освоился уже здесь? Никто не обижает? Это хорошо-хорошо. У нас, на севере Рогалии, леса полны дичи, в реках полно рыбы, а земля богата полезными ископаемыми.  Думаю, ты сможешь найти свое место в нашем мире.",
            },
        },
        "tour-5": {
            name: {
                "en": "",
                "ru": "Клейм",
            },
            desc: {
                "en": "",
                "ru": "Чтобы считаться гражданином Рогалии, тебе нужно взять лицензию на клейм. Сделай это сейчас.",
            },
            tip: {
                "en": "",
                "ru": "Как взять лицензию на клейм: 1) Получить 10 уровень 2) Накопить 8 золота 3) Выбираем Чарльза -> Получить клейм. Клейм можно расширить, если в банке есть деньги.",
            },
            final: {
                "en": "",
                "ru": "Отлично, теперь ты можешь поставить свой клейм. (Крафт -> Лидерство -> Клейм); Клемй следует оплачивать через банк раз в неделю, впрочем можно оплатить и на более длительный период.",
            },
        },
        "tour-6": {
            name: {
                "en": "",
                "ru": "Священник Борис",
            },
            desc: {
                "en": "",
                "ru": "Ну вот, теперь ты гражданин Рогалии, поздравляю. Правда есть еще один момент, который тебе нужно знать... Вообще, иди к священнику Борису, он разъяснит.",
            },
            tip: {
                "en": "",
                "ru": "Чтобы твой дом работал как надо, нужно помещать стены и ворота внутри твоего клейма.",
            },
            final: {
                "en": "",
                "ru": "Дитя Божее, все мы грешны, и кара Господня будет ждать тебя, если ты сделаешь что-то плохое. Например, убъешь другого человека... Ооо... Это страшный грех. Твой показатель кармы станет отрицательным и Иисус покарает тебя своей божественной силой.",
            },
        },
        "tour-end": {
            name: {
                "en": "",
                "ru": "Прощание",
            },
            desc: {
                "en": "",
                "ru": "Иисус всегда следит за тобой, помни об этом, дитя. А теперь ступай к Чарльзу.",
            },
            tip: {
                "en": "",
                "ru": "Если тебя убьют, ты будешь оживлен в городе или у возраждателя. Смерть отнимет все твои витамины, половину очков обучения и заодно все вещи. Впрочем, до 10 уровня твоя сумка останется при тебе.",
            },
            final: {
                "en": "",
                "ru": "Теперь ты все знаешь, все умеешь. Последний совет - сделай возрождатель и тогда ты всегда сможешь появится возле него, если вдруг умрешь. Удачи тебе!",
            },
        },
        "faction-daily-1": {
            name: {
                "en": "",
                "ru": "Помощь фракции (ежедневный)",
            },
            desc: {
                "en": "",
                "ru": "Повысить статус внутри фракции",
            },
            final: {
                "en": "",
                "ru": "",
            },
        },
        "garland-daily": {
            name: {
                "en": "",
                "ru": "Гирлянда (ежедневный)",
            },
            desc: {
                "en": "",
                "ru": "Помоги деду морозу сделать гирлянду",
            },
            final: {
                "en": "",
                "ru": "",
            },
        },
        "chrismas-flags-daily": {
            name: {
                "en": "",
                "ru": "Флажки (ежедневный)",
            },
            desc: {
                "en": "",
                "ru": "Помоги Деду Морозу сделать бумажные флажки",
            },
            final: {
                "en": "",
                "ru": "",
            },
        },
        "chrismas-decoration-daily-1": {
            name: {
                "en": "",
                "ru": "Бумажные украшения (ежедневный)",
            },
            desc: {
                "en": "",
                "ru": "Помоги Снегурочке сделать бумажные украшения",
            },
            final: {
                "en": "",
                "ru": "",
            },
        },
        "chrismas-decoration-daily-2": {
            name: {
                "en": "",
                "ru": "Стеклянные украшения (ежедневный)",
            },
            desc: {
                "en": "",
                "ru": "Помоги Снегурочке сделать стеклянные украшения",
            },
            final: {
                "en": "",
                "ru": "",
            },
        },
    };
};
